zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/MC56F83789/codewarrior/MC56F83789_Vectors.c
/* User could redefine ivINT_I2C0.
Please be noted that ivINT_I2C0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_I2C0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_I2C0(void);
__attribute__((weak)) void ivINT_I2C0(void)
{
    I2C0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_FAULT **********************/

/* User could redefine ivINT_eFlexPWMB_FAULT.
Please be noted that ivINT_eFlexPWMB_FAULT can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_FAULT definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_FAULT(void);
__attribute__((weak)) void ivINT_eFlexPWMB_FAULT(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RERR **********************/

/* User could redefine ivINT_eFlexPWMB_RERR.
Please be noted that ivINT_eFlexPWMB_RERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RERR(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RERR(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CAP **********************/

/* User could redefine ivINT_eFlexPWMB_CAP.
Please be noted that ivINT_eFlexPWMB_CAP can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CAP definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CAP(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CAP(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD3 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD3.
Please be noted that ivINT_eFlexPWMB_RELOAD3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD3(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CMP3 **********************/

/* User could redefine ivINT_eFlexPWMB_CMP3.
Please be noted that ivINT_eFlexPWMB_CMP3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CMP3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CMP3(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CMP3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD2 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD2.
Please be noted that ivINT_eFlexPWMB_RELOAD2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD2(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CMP2 **********************/

/* User could redefine ivINT_eFlexPWMB_CMP2.
Please be noted that ivINT_eFlexPWMB_CMP2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CMP2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CMP2(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CMP2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD1 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD1.
Please be noted that ivINT_eFlexPWMB_RELOAD1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD1(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CMP1 **********************/

/* User could redefine ivINT_eFlexPWMB_CMP1.
Please be noted that ivINT_eFlexPWMB_CMP1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CMP1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CMP1(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CMP1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD0 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD0.
Please be noted that ivINT_eFlexPWMB_RELOAD0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD0(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CMP0 **********************/

/* User could redefine ivINT_eFlexPWMB_CMP0.
Please be noted that ivINT_eFlexPWMB_CMP0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CMP0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CMP0(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CMP0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMA_FAULT **********************/

